import React from 'react';
import { useJsApiLoader } from '@react-google-maps/api';
import Map from '../components/Map';
const containerStyle: React.CSSProperties = {
  width: '100%',
  height: '40vh'
};

const vitiLocation: google.maps.LatLngLiteral = {
  lat: 50.43012204275398,
  lng: 30.54400779179949
};

const About: React.FC = () => {
  const { isLoaded } = useJsApiLoader({
    id: 'google-map-script',
    googleMapsApiKey: "AIzaSyBqVMbGUagGhsttUJGP68IX1nb_XkmWvFQ" 
  });
  

  return (<>

    <section className="about text-black">
      <article>
        <h2>Про Сайт</h2>
        <p>
          Ласкаво просимо на наш веб-сайт, присвячений Кавалерам Медалі Пошани українського походження. Тут ми розповідаємо історії визначних особистостей, які відзначилися своєю великою мужністю, внеском у військову службу та отримали високі військові нагороди.
        </p>

        <h3>Мета та Зміст</h3>
        <p>
          Наш сайт спрямований на вивчення та вшанування подвигів Кавалерів Медалі Пошани, які своїм героїзмом стали справжніми прикладами військової відданості та патріотизму.
        </p>

        <h4>Історії Героїв</h4>
        <p>
          Детальні розповіді про кожного Кавалера, включаючи їхнє життя перед воєнною службою та визначні моменти в їхній кар'єрі.
        </p>

        <h4>Військові Нагороди</h4>
        <p>
          Огляд інформації про Медалі Пошани та інші військові нагороди, які були вручені нашим героям за високі досягнення та винятковий внесок.
        </p>

        <h4>Фото та Документи</h4>
        <p>
          Унікальні фотографії, документи та артефакти, які ілюструють важливі етапи служби та особисте життя Кавалерів.
        </p>

        <h3>Як Користуватися Сайтом</h3>
        <p>
          Для того щоб краще ознайомитися із матеріалами, використовуйте наше зручне меню та навігаційні елементи. Ви можете шукати конкретних героїв, переглядати їхні історії та долучати до вивчення військової служби та нагород.
        </p>

        <h3>Запитання та Зворотній Зв'язок</h3>
        <p>
          Якщо у вас виникли запитання, або ви маєте інформацію, яку хочете поділитися, не соромтеся зв'язатися з нами через нашу контактну форму. Ваш внесок може бути важливим для розширення нашого розуміння та вшанування наших героїв.
        </p>

        <p>
          Дякуємо за відвідування нашого сайту та висловлюємо повагу та шану всім, хто служив та служить в армії, захищаючи нашу країну.
        </p>
      </article>


      <article className="text-black">
        <h3>Підтримати сайт</h3>
        <p>
          Ми вкладаємо свої зусилля та ресурси у створення якісного контенту та удосконалення нашого сервісу. Ваша підтримка має велике значення для нас і допомагає нам забезпечувати вам ще кращі можливості
        </p>
        <a href="#">Підтримати</a>
      </article>
    </section>
    <div className='w-full overflow-hidden'>
      {isLoaded ? (
        <Map
          mapContainerStyle={containerStyle}
          center={vitiLocation}
          zoom={13}
          markerPosition={vitiLocation}
          markerIcon={{ url: 'data:image/svg+xml;utf8,<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 24 24"><path d="M19.527 4.799c1.212 2.608.937 5.678-.405 8.173-1.101 2.047-2.744 3.74-4.098 5.614-.619.858-1.244 1.75-1.669 2.727-.141.325-.263.658-.383.992-.121.333-.224.673-.34 1.008-.109.314-.236.684-.627.687h-.007c-.466-.001-.579-.53-.695-.887-.284-.874-.581-1.713-1.019-2.525-.51-.944-1.145-1.817-1.79-2.671L19.527 4.799zM8.545 7.705l-3.959 4.707c.724 1.54 1.821 2.863 2.871 4.18.247.31.494.622.737.936l4.984-5.925-.029.01c-1.741.601-3.691-.291-4.392-1.987a3.377 3.377 0 0 1-.209-.716c-.063-.437-.077-.761-.004-1.198l.001-.007zM5.492 3.149l-.003.004c-1.947 2.466-2.281 5.88-1.117 8.77l4.785-5.689-.058-.05-3.607-3.035zM14.661.436l-3.838 4.563a.295.295 0 0 1 .027-.01c1.6-.551 3.403.15 4.22 1.626.176.319.323.683.377 1.045.068.446.085.773.012 1.22l-.003.016 3.836-4.561A8.382 8.382 0 0 0 14.67.439l-.009-.003zM9.466 5.868L14.162.285l-.047-.012A8.31 8.31 0 0 0 11.986 0a8.439 8.439 0 0 0-6.169 2.766l-.016.018 3.665 3.084z"/></svg>' }}
        />
      ) : <></>}
    </div>
  </>
  );
};

export default About;
